{
    "format": "layers-model",
    "generatedBy": "keras v2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.8.0",
    "modelTopology": {
        "keras_version": "2.5.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_4",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                12,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "lstm_3_input"
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_3",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                12,
                                1
                            ],
                            "dtype": "float32",
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 10,
                            "activation": "relu",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "HeNormal",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": {
                                "class_name": "L2",
                                "config": {
                                    "l2": 0.009999999776482582
                                }
                            },
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 2
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mse",
            "metrics": null,
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        10,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell_3/kernel",
                    "shape": [
                        1,
                        40
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell_3/recurrent_kernel",
                    "shape": [
                        10,
                        40
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_3/lstm_cell_3/bias",
                    "shape": [
                        40
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}