{
    "format": "layers-model",
    "generatedBy": "keras v2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.8.0",
    "modelTopology": {
        "keras_version": "2.5.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "mnist_model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                28,
                                28
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_8"
                        },
                        "name": "input_8",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_7",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        },
                        "name": "flatten_7",
                        "inbound_nodes": [
                            [
                                [
                                    "input_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_16",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_16",
                        "inbound_nodes": [
                            [
                                [
                                    "flatten_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "category_output",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 10,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "category_output",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_16",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "leftright_output",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "leftright_output",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_16",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_8",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "category_output",
                        0,
                        0
                    ],
                    [
                        "leftright_output",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": {
                "category_output": {
                    "class_name": "SparseCategoricalCrossentropy",
                    "config": {
                        "reduction": "auto",
                        "name": "sparse_categorical_crossentropy",
                        "from_logits": false
                    }
                },
                "leftright_output": {
                    "class_name": "BinaryCrossentropy",
                    "config": {
                        "reduction": "auto",
                        "name": "binary_crossentropy",
                        "from_logits": false,
                        "label_smoothing": 0
                    }
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "category_output_accuracy",
                            "dtype": "float32",
                            "fn": "sparse_categorical_accuracy"
                        }
                    }
                ],
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "leftright_output_accuracy",
                            "dtype": "float32",
                            "fn": "binary_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "category_output/kernel",
                    "shape": [
                        128,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "category_output/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_16/kernel",
                    "shape": [
                        784,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_16/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "leftright_output/kernel",
                    "shape": [
                        128,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "leftright_output/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}